Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/uart_reg.h
/* 0x28 : UART interrupt clear */
#define UART_INT_CLEAR_OFFSET    (0x28)
#define UART_CR_UTX_END_CLR      UART_CR_UTX_END_CLR
#define UART_CR_UTX_END_CLR_POS  (0U)
#define UART_CR_UTX_END_CLR_LEN  (1U)
#define UART_CR_UTX_END_CLR_MSK  (((1U << UART_CR_UTX_END_CLR_LEN) - 1) << UART_CR_UTX_END_CLR_POS)
#define UART_CR_UTX_END_CLR_UMSK (~(((1U << UART_CR_UTX_END_CLR_LEN) - 1) << UART_CR_UTX_END_CLR_POS))
#define UART_CR_URX_END_CLR      UART_CR_URX_END_CLR
#define UART_CR_URX_END_CLR_POS  (1U)
#define UART_CR_URX_END_CLR_LEN  (1U)
#define UART_CR_URX_END_CLR_MSK  (((1U << UART_CR_URX_END_CLR_LEN) - 1) << UART_CR_URX_END_CLR_POS)
#define UART_CR_URX_END_CLR_UMSK (~(((1U << UART_CR_URX_END_CLR_LEN) - 1) << UART_CR_URX_END_CLR_POS))
#define UART_CR_URX_RTO_CLR      UART_CR_URX_RTO_CLR
#define UART_CR_URX_RTO_CLR_POS  (4U)
#define UART_CR_URX_RTO_CLR_LEN  (1U)
#define UART_CR_URX_RTO_CLR_MSK  (((1U << UART_CR_URX_RTO_CLR_LEN) - 1) << UART_CR_URX_RTO_CLR_POS)
#define UART_CR_URX_RTO_CLR_UMSK (~(((1U << UART_CR_URX_RTO_CLR_LEN) - 1) << UART_CR_URX_RTO_CLR_POS))
#define UART_CR_URX_PCE_CLR      UART_CR_URX_PCE_CLR
#define UART_CR_URX_PCE_CLR_POS  (5U)
#define UART_CR_URX_PCE_CLR_LEN  (1U)
#define UART_CR_URX_PCE_CLR_MSK  (((1U << UART_CR_URX_PCE_CLR_LEN) - 1) << UART_CR_URX_PCE_CLR_POS)
#define UART_CR_URX_PCE_CLR_UMSK (~(((1U << UART_CR_URX_PCE_CLR_LEN) - 1) << UART_CR_URX_PCE_CLR_POS))
#define UART_CR_URX_LSE_CLR      UART_CR_URX_LSE_CLR
#define UART_CR_URX_LSE_CLR_POS  (8U)
#define UART_CR_URX_LSE_CLR_LEN  (1U)
#define UART_CR_URX_LSE_CLR_MSK  (((1U << UART_CR_URX_LSE_CLR_LEN) - 1) << UART_CR_URX_LSE_CLR_POS)
#define UART_CR_URX_LSE_CLR_UMSK (~(((1U << UART_CR_URX_LSE_CLR_LEN) - 1) << UART_CR_URX_LSE_CLR_POS))

/* 0x2C : UART interrupt enable */
#define UART_INT_EN_OFFSET       (0x2C)
#define UART_CR_UTX_END_EN       UART_CR_UTX_END_EN
#define UART_CR_UTX_END_EN_POS   (0U)
#define UART_CR_UTX_END_EN_LEN   (1U)
#define UART_CR_UTX_END_EN_MSK   (((1U << UART_CR_UTX_END_EN_LEN) - 1) << UART_CR_UTX_END_EN_POS)
#define UART_CR_UTX_END_EN_UMSK  (~(((1U << UART_CR_UTX_END_EN_LEN) - 1) << UART_CR_UTX_END_EN_POS))
#define UART_CR_URX_END_EN       UART_CR_URX_END_EN
#define UART_CR_URX_END_EN_POS   (1U)
#define UART_CR_URX_END_EN_LEN   (1U)
#define UART_CR_URX_END_EN_MSK   (((1U << UART_CR_URX_END_EN_LEN) - 1) << UART_CR_URX_END_EN_POS)
#define UART_CR_URX_END_EN_UMSK  (~(((1U << UART_CR_URX_END_EN_LEN) - 1) << UART_CR_URX_END_EN_POS))
#define UART_CR_UTX_FIFO_EN      UART_CR_UTX_FIFO_EN
#define UART_CR_UTX_FIFO_EN_POS  (2U)
#define UART_CR_UTX_FIFO_EN_LEN  (1U)
#define UART_CR_UTX_FIFO_EN_MSK  (((1U << UART_CR_UTX_FIFO_EN_LEN) - 1) << UART_CR_UTX_FIFO_EN_POS)
#define UART_CR_UTX_FIFO_EN_UMSK (~(((1U << UART_CR_UTX_FIFO_EN_LEN) - 1) << UART_CR_UTX_FIFO_EN_POS))
#define UART_CR_URX_FIFO_EN      UART_CR_URX_FIFO_EN
#define UART_CR_URX_FIFO_EN_POS  (3U)
#define UART_CR_URX_FIFO_EN_LEN  (1U)
#define UART_CR_URX_FIFO_EN_MSK  (((1U << UART_CR_URX_FIFO_EN_LEN) - 1) << UART_CR_URX_FIFO_EN_POS)
#define UART_CR_URX_FIFO_EN_UMSK (~(((1U << UART_CR_URX_FIFO_EN_LEN) - 1) << UART_CR_URX_FIFO_EN_POS))
#define UART_CR_URX_RTO_EN       UART_CR_URX_RTO_EN
#define UART_CR_URX_RTO_EN_POS   (4U)
#define UART_CR_URX_RTO_EN_LEN   (1U)
#define UART_CR_URX_RTO_EN_MSK   (((1U << UART_CR_URX_RTO_EN_LEN) - 1) << UART_CR_URX_RTO_EN_POS)
#define UART_CR_URX_RTO_EN_UMSK  (~(((1U << UART_CR_URX_RTO_EN_LEN) - 1) << UART_CR_URX_RTO_EN_POS))
#define UART_CR_URX_PCE_EN       UART_CR_URX_PCE_EN
#define UART_CR_URX_PCE_EN_POS   (5U)
#define UART_CR_URX_PCE_EN_LEN   (1U)
#define UART_CR_URX_PCE_EN_MSK   (((1U << UART_CR_URX_PCE_EN_LEN) - 1) << UART_CR_URX_PCE_EN_POS)
#define UART_CR_URX_PCE_EN_UMSK  (~(((1U << UART_CR_URX_PCE_EN_LEN) - 1) << UART_CR_URX_PCE_EN_POS))
#define UART_CR_UTX_FER_EN       UART_CR_UTX_FER_EN
#define UART_CR_UTX_FER_EN_POS   (6U)
#define UART_CR_UTX_FER_EN_LEN   (1U)
#define UART_CR_UTX_FER_EN_MSK   (((1U << UART_CR_UTX_FER_EN_LEN) - 1) << UART_CR_UTX_FER_EN_POS)
#define UART_CR_UTX_FER_EN_UMSK  (~(((1U << UART_CR_UTX_FER_EN_LEN) - 1) << UART_CR_UTX_FER_EN_POS))
#define UART_CR_URX_FER_EN       UART_CR_URX_FER_EN
#define UART_CR_URX_FER_EN_POS   (7U)
#define UART_CR_URX_FER_EN_LEN   (1U)
#define UART_CR_URX_FER_EN_MSK   (((1U << UART_CR_URX_FER_EN_LEN) - 1) << UART_CR_URX_FER_EN_POS)
#define UART_CR_URX_FER_EN_UMSK  (~(((1U << UART_CR_URX_FER_EN_LEN) - 1) << UART_CR_URX_FER_EN_POS))
#define UART_CR_URX_LSE_EN       UART_CR_URX_LSE_EN
#define UART_CR_URX_LSE_EN_POS   (8U)
#define UART_CR_URX_LSE_EN_LEN   (1U)
#define UART_CR_URX_LSE_EN_MSK   (((1U << UART_CR_URX_LSE_EN_LEN) - 1) << UART_CR_URX_LSE_EN_POS)
#define UART_CR_URX_LSE_EN_UMSK  (~(((1U << UART_CR_URX_LSE_EN_LEN) - 1) << UART_CR_URX_LSE_EN_POS))

/* 0x30 : uart_status */
#define UART_STATUS_OFFSET         (0x30)
#define UART_STS_UTX_BUS_BUSY      UART_STS_UTX_BUS_BUSY
#define UART_STS_UTX_BUS_BUSY_POS  (0U)
#define UART_STS_UTX_BUS_BUSY_LEN  (1U)
#define UART_STS_UTX_BUS_BUSY_MSK  (((1U << UART_STS_UTX_BUS_BUSY_LEN) - 1) << UART_STS_UTX_BUS_BUSY_POS)
#define UART_STS_UTX_BUS_BUSY_UMSK (~(((1U << UART_STS_UTX_BUS_BUSY_LEN) - 1) << UART_STS_UTX_BUS_BUSY_POS))
#define UART_STS_URX_BUS_BUSY      UART_STS_URX_BUS_BUSY
#define UART_STS_URX_BUS_BUSY_POS  (1U)
#define UART_STS_URX_BUS_BUSY_LEN  (1U)
#define UART_STS_URX_BUS_BUSY_MSK  (((1U << UART_STS_URX_BUS_BUSY_LEN) - 1) << UART_STS_URX_BUS_BUSY_POS)
#define UART_STS_URX_BUS_BUSY_UMSK (~(((1U << UART_STS_URX_BUS_BUSY_LEN) - 1) << UART_STS_URX_BUS_BUSY_POS))

/* 0x34 : sts_urx_abr_prd */
#define UART_STS_URX_ABR_PRD_OFFSET     (0x34)
#define UART_STS_URX_ABR_PRD_START      UART_STS_URX_ABR_PRD_START
#define UART_STS_URX_ABR_PRD_START_POS  (0U)
#define UART_STS_URX_ABR_PRD_START_LEN  (16U)
#define UART_STS_URX_ABR_PRD_START_MSK  (((1U << UART_STS_URX_ABR_PRD_START_LEN) - 1) << UART_STS_URX_ABR_PRD_START_POS)
#define UART_STS_URX_ABR_PRD_START_UMSK (~(((1U << UART_STS_URX_ABR_PRD_START_LEN) - 1) << UART_STS_URX_ABR_PRD_START_POS))
#define UART_STS_URX_ABR_PRD_0X55       UART_STS_URX_ABR_PRD_0X55
#define UART_STS_URX_ABR_PRD_0X55_POS   (16U)
#define UART_STS_URX_ABR_PRD_0X55_LEN   (16U)
#define UART_STS_URX_ABR_PRD_0X55_MSK   (((1U << UART_STS_URX_ABR_PRD_0X55_LEN) - 1) << UART_STS_URX_ABR_PRD_0X55_POS)
#define UART_STS_URX_ABR_PRD_0X55_UMSK  (~(((1U << UART_STS_URX_ABR_PRD_0X55_LEN) - 1) << UART_STS_URX_ABR_PRD_0X55_POS))

/* 0x80 : uart_fifo_config_0 */
#define UART_FIFO_CONFIG_0_OFFSET   (0x80)
#define UART_DMA_TX_EN              UART_DMA_TX_EN
#define UART_DMA_TX_EN_POS          (0U)
#define UART_DMA_TX_EN_LEN          (1U)
#define UART_DMA_TX_EN_MSK          (((1U << UART_DMA_TX_EN_LEN) - 1) << UART_DMA_TX_EN_POS)
#define UART_DMA_TX_EN_UMSK         (~(((1U << UART_DMA_TX_EN_LEN) - 1) << UART_DMA_TX_EN_POS))
#define UART_DMA_RX_EN              UART_DMA_RX_EN
#define UART_DMA_RX_EN_POS          (1U)
#define UART_DMA_RX_EN_LEN          (1U)
#define UART_DMA_RX_EN_MSK          (((1U << UART_DMA_RX_EN_LEN) - 1) << UART_DMA_RX_EN_POS)
#define UART_DMA_RX_EN_UMSK         (~(((1U << UART_DMA_RX_EN_LEN) - 1) << UART_DMA_RX_EN_POS))
#define UART_TX_FIFO_CLR            UART_TX_FIFO_CLR
#define UART_TX_FIFO_CLR_POS        (2U)
#define UART_TX_FIFO_CLR_LEN        (1U)
#define UART_TX_FIFO_CLR_MSK        (((1U << UART_TX_FIFO_CLR_LEN) - 1) << UART_TX_FIFO_CLR_POS)
#define UART_TX_FIFO_CLR_UMSK       (~(((1U << UART_TX_FIFO_CLR_LEN) - 1) << UART_TX_FIFO_CLR_POS))
#define UART_RX_FIFO_CLR            UART_RX_FIFO_CLR
#define UART_RX_FIFO_CLR_POS        (3U)
#define UART_RX_FIFO_CLR_LEN        (1U)
#define UART_RX_FIFO_CLR_MSK        (((1U << UART_RX_FIFO_CLR_LEN) - 1) << UART_RX_FIFO_CLR_POS)
#define UART_RX_FIFO_CLR_UMSK       (~(((1U << UART_RX_FIFO_CLR_LEN) - 1) << UART_RX_FIFO_CLR_POS))
#define UART_TX_FIFO_OVERFLOW       UART_TX_FIFO_OVERFLOW
#define UART_TX_FIFO_OVERFLOW_POS   (4U)
#define UART_TX_FIFO_OVERFLOW_LEN   (1U)
#define UART_TX_FIFO_OVERFLOW_MSK   (((1U << UART_TX_FIFO_OVERFLOW_LEN) - 1) << UART_TX_FIFO_OVERFLOW_POS)
#define UART_TX_FIFO_OVERFLOW_UMSK  (~(((1U << UART_TX_FIFO_OVERFLOW_LEN) - 1) << UART_TX_FIFO_OVERFLOW_POS))
#define UART_TX_FIFO_UNDERFLOW      UART_TX_FIFO_UNDERFLOW
#define UART_TX_FIFO_UNDERFLOW_POS  (5U)
#define UART_TX_FIFO_UNDERFLOW_LEN  (1U)
#define UART_TX_FIFO_UNDERFLOW_MSK  (((1U << UART_TX_FIFO_UNDERFLOW_LEN) - 1) << UART_TX_FIFO_UNDERFLOW_POS)
#define UART_TX_FIFO_UNDERFLOW_UMSK (~(((1U << UART_TX_FIFO_UNDERFLOW_LEN) - 1) << UART_TX_FIFO_UNDERFLOW_POS))
#define UART_RX_FIFO_OVERFLOW       UART_RX_FIFO_OVERFLOW
#define UART_RX_FIFO_OVERFLOW_POS   (6U)
#define UART_RX_FIFO_OVERFLOW_LEN   (1U)
#define UART_RX_FIFO_OVERFLOW_MSK   (((1U << UART_RX_FIFO_OVERFLOW_LEN) - 1) << UART_RX_FIFO_OVERFLOW_POS)
#define UART_RX_FIFO_OVERFLOW_UMSK  (~(((1U << UART_RX_FIFO_OVERFLOW_LEN) - 1) << UART_RX_FIFO_OVERFLOW_POS))
#define UART_RX_FIFO_UNDERFLOW      UART_RX_FIFO_UNDERFLOW
#define UART_RX_FIFO_UNDERFLOW_POS  (7U)
#define UART_RX_FIFO_UNDERFLOW_LEN  (1U)
#define UART_RX_FIFO_UNDERFLOW_MSK  (((1U << UART_RX_FIFO_UNDERFLOW_LEN) - 1) << UART_RX_FIFO_UNDERFLOW_POS)
#define UART_RX_FIFO_UNDERFLOW_UMSK (~(((1U << UART_RX_FIFO_UNDERFLOW_LEN) - 1) << UART_RX_FIFO_UNDERFLOW_POS))

/* 0x84 : uart_fifo_config_1 */
#define UART_FIFO_CONFIG_1_OFFSET (0x84)
#define UART_TX_FIFO_CNT          UART_TX_FIFO_CNT
#define UART_TX_FIFO_CNT_POS      (0U)
#define UART_TX_FIFO_CNT_LEN      (8U)
#define UART_TX_FIFO_CNT_MSK      (((1U << UART_TX_FIFO_CNT_LEN) - 1) << UART_TX_FIFO_CNT_POS)
#define UART_TX_FIFO_CNT_UMSK     (~(((1U << UART_TX_FIFO_CNT_LEN) - 1) << UART_TX_FIFO_CNT_POS))
#define UART_RX_FIFO_CNT          UART_RX_FIFO_CNT
#define UART_RX_FIFO_CNT_POS      (8U)
#define UART_RX_FIFO_CNT_LEN      (8U)
#define UART_RX_FIFO_CNT_MSK      (((1U << UART_RX_FIFO_CNT_LEN) - 1) << UART_RX_FIFO_CNT_POS)
#define UART_RX_FIFO_CNT_UMSK     (~(((1U << UART_RX_FIFO_CNT_LEN) - 1) << UART_RX_FIFO_CNT_POS))
#define UART_TX_FIFO_TH           UART_TX_FIFO_TH
#define UART_TX_FIFO_TH_POS       (16U)
#define UART_TX_FIFO_TH_LEN       (7U)
#define UART_TX_FIFO_TH_MSK       (((1U << UART_TX_FIFO_TH_LEN) - 1) << UART_TX_FIFO_TH_POS)
#define UART_TX_FIFO_TH_UMSK      (~(((1U << UART_TX_FIFO_TH_LEN) - 1) << UART_TX_FIFO_TH_POS))
#define UART_RX_FIFO_TH           UART_RX_FIFO_TH
#define UART_RX_FIFO_TH_POS       (24U)
#define UART_RX_FIFO_TH_LEN       (7U)
#define UART_RX_FIFO_TH_MSK       (((1U << UART_RX_FIFO_TH_LEN) - 1) << UART_RX_FIFO_TH_POS)
#define UART_RX_FIFO_TH_UMSK      (~(((1U << UART_RX_FIFO_TH_LEN) - 1) << UART_RX_FIFO_TH_POS))

