Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/uart_reg.h
    /* 0x28 : UART interrupt clear */
    union {
        struct
        {
            uint32_t cr_utx_end_clr : 1;  /* [    0],        w1c,        0x0 */
            uint32_t cr_urx_end_clr : 1;  /* [    1],        w1c,        0x0 */
            uint32_t rsvd_2         : 1;  /* [    2],       rsvd,        0x0 */
            uint32_t rsvd_3         : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t cr_urx_rto_clr : 1;  /* [    4],        w1c,        0x0 */
            uint32_t cr_urx_pce_clr : 1;  /* [    5],        w1c,        0x0 */
            uint32_t rsvd_6         : 1;  /* [    6],       rsvd,        0x0 */
            uint32_t rsvd_7         : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t cr_urx_lse_clr : 1;  /* [    8],        w1c,        0x0 */
            uint32_t reserved_9_31  : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_int_clear;

    /* 0x2C : UART interrupt enable */
    union {
        struct
        {
            uint32_t cr_utx_end_en  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cr_urx_end_en  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cr_utx_fifo_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t cr_urx_fifo_en : 1;  /* [    3],        r/w,        0x1 */
            uint32_t cr_urx_rto_en  : 1;  /* [    4],        r/w,        0x1 */
            uint32_t cr_urx_pce_en  : 1;  /* [    5],        r/w,        0x1 */
            uint32_t cr_utx_fer_en  : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cr_urx_fer_en  : 1;  /* [    7],        r/w,        0x1 */
            uint32_t cr_urx_lse_en  : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_31  : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_int_en;

    /* 0x30 : uart_status */
    union {
        struct
        {
            uint32_t sts_utx_bus_busy : 1;  /* [    0],          r,        0x0 */
            uint32_t sts_urx_bus_busy : 1;  /* [    1],          r,        0x0 */
            uint32_t reserved_2_31    : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_status;

    /* 0x34 : sts_urx_abr_prd */
    union {
        struct
        {
            uint32_t sts_urx_abr_prd_start : 16; /* [15: 0],          r,        0x0 */
            uint32_t sts_urx_abr_prd_0x55  : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } sts_urx_abr_prd;

    /* 0x38  reserved */
    uint8_t RESERVED0x38[72];

    /* 0x80 : uart_fifo_config_0 */
    union {
        struct
        {
            uint32_t uart_dma_tx_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t uart_dma_rx_en    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_fifo_config_0;

    /* 0x84 : uart_fifo_config_1 */
    union {
        struct
        {
            uint32_t tx_fifo_cnt : 8; /* [ 7: 0],          r,       0x80 */
            uint32_t rx_fifo_cnt : 8; /* [15: 8],          r,        0x0 */
            uint32_t tx_fifo_th  : 7; /* [22:16],        r/w,        0x0 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t rx_fifo_th  : 7; /* [30:24],        r/w,        0x0 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_fifo_config_1;

    /* 0x88 : uart_fifo_wdata */
    union {
        struct
        {
            uint32_t uart_fifo_wdata : 8;  /* [ 7: 0],          w,          x */
            uint32_t reserved_8_31   : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_fifo_wdata;

    /* 0x8C : uart_fifo_rdata */
    union {
        struct
        {
            uint32_t uart_fifo_rdata : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31   : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_fifo_rdata;
};

typedef volatile struct uart_reg uart_reg_t;

#endif /* __UART_REG_H__ */
